package OtherTasks.GMByte.Lesson2;

/**
 * Created by Олександр Шаповал on 11.11.2016
 *
 * Lesson - 2
 *
 * 1) Выведите на экран, пять раз, строку:
 * "Ура! Сделан мой первый шаг в java!".
 *
 * Примечание: Каждый вывод должен начинаться с новой строки!
 *
 * 2) Сделайте тоже самое, что и в первом задании, только теперь всё
 * должно быть выведено в одну строку и разделено пробелами.
 *
 * Примечание: Для вывода каждой новой строки должна использоваться
 * отдельная команда!
 *
 * https://youtu.be/aWf2uCcC2Nk?list=PLk95cAdGYXN1GYSm1NIMHJuyq_kk9Obg9
 */

public class FirstProgramm {
    public static void main(String[] args) {
        System.out.println("Ура! Сделан мой первый шаг в java!");
        System.out.println("Ура! Сделан мой первый шаг в java!");
        System.out.println("Ура! Сделан мой первый шаг в java!");
        System.out.println("Ура! Сделан мой первый шаг в java!");
        System.out.println("Ура! Сделан мой первый шаг в java!");
        System.out.println();
        System.out.print("Ура! Сделан мой первый шаг в java! ");
        System.out.print("Ура! Сделан мой первый шаг в java! ");
        System.out.print("Ура! Сделан мой первый шаг в java! ");
        System.out.print("Ура! Сделан мой первый шаг в java! ");
        System.out.print("Ура! Сделан мой первый шаг в java! ");
    }
}