package OtherTasks.GMByte.Lesson2;

/**
 * Created by Олександр Шаповал on 11.11.2016
 *
 * Lesson - 2 - Первая программа:
 *
 * https://youtu.be/aWf2uCcC2Nk?list=PLk95cAdGYXN1GYSm1NIMHJuyq_kk9Obg9
 *
 * 1) Выведите на экран, пять раз, строку:
 * "Ура! Сделан мой первый шаг в java!".
 *
 * Примечание: Каждый вывод должен начинаться с новой строки!
 *
 * 2) Сделайте тоже самое, что и в первом задании, только теперь всё
 * должно быть выведено в одну строку и разделено пробелами.
 *
 * Примечание: Для вывода каждой новой строки должна использоваться
 * отдельная команда!
 *
 * https://docviewer.yandex.ua/?url=ya-disk-public%3A%2F%2FWRJzA1WIPQGSpsK1qOgpikP07Sl4LwzEVcat7oIksDQ%3D&name=Domashnie_zadania_k_urokam_1-_15.txt&page=1&c=5829b3df2c26
 */

public class FirstProgramm {
    public static void main(String[] args) {
        System.out.println("Ура! Сделан мой первый шаг в java!");
        System.out.println("Ура! Сделан мой первый шаг в java!");
        System.out.println("Ура! Сделан мой первый шаг в java!");
        System.out.println("Ура! Сделан мой первый шаг в java!");
        System.out.println("Ура! Сделан мой первый шаг в java!");
        System.out.println();
        System.out.print("Ура! Сделан мой первый шаг в java! ");
        System.out.print("Ура! Сделан мой первый шаг в java! ");
        System.out.print("Ура! Сделан мой первый шаг в java! ");
        System.out.print("Ура! Сделан мой первый шаг в java! ");
        System.out.print("Ура! Сделан мой первый шаг в java! ");
    }
}